; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?o1 ?o2)
	       (ontable ?o1)
	       (clear ?o1)
	       (handempty)
	       (holding ?o1)
	       )

  (:action pick-up
	     :parameters (?o1)
	     :precondition (and (clear ?o1) (ontable ?o1) (handempty))
	     :effect
	     (and (not (ontable ?o1))
		   (not (clear ?o1))
		   (not (handempty))
		   (holding ?o1)))

  (:action put-down
	     :parameters (?o1)
	     :precondition (and (holding ?o1))
	     :effect
	     (and (not (holding ?o1))
		   (clear ?o1)
		   (handempty)
		   (ontable ?o1)))
  (:action stack
	     :parameters (?o1 ?o2)
	     :precondition (and (holding ?o1) (clear ?o2))
	     :effect
	     (and (not (holding ?o1))
		   (not (clear ?o2))
		   (clear ?o1)
		   (handempty)
		   (on ?o1 ?o2)))
  (:action unstack
	     :parameters (?o1 ?o2)
	     :precondition (and (on ?o1 ?o2) (clear ?o1) (handempty))
	     :effect
	     (and (holding ?o1)
		   (clear ?o2)
		   (not (clear ?o1))
		   (not (handempty))
		   (not (on ?o1 ?o2)))))

; problem
(define (problem test-4-4)
(:domain blocks)
(:objects D C B A - object)
(:init
       	   (holding A)
       	   (ontable D)	   
           (on C D)
	   (on B C)
	   (clear B) 	   
       )
(:goal (AND

	   (handempty)

	   (not (holding A))
	   (not (holding B))
	   (not (holding C))
	   (not (holding D))


           (not (ontable A))
           (not (ontable C))
           (ontable D)
           (ontable B)

	   (not (on D A))
	   (not (on D B))
	   (not (on D C))
	   (not (on D D))	   	   

           (not (on C A))
           (on C B)
           (not (on C C))
	   (not (on C D))	   


	   (not (on B A))
	   (not (on B B))
	   (not (on B C))
	   (not (on B D))

	   (not (on A A))
	   (not (on A B))	   
	   (not (on A C))
	   (on A D)	  

	   (clear A)
	   (not (clear B))	   
	   (clear C)	   
	   (not (clear D))
)))

; plan
1. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 21 of 29
2. (unstack b c)
   deleted: (clear b) (handempty) (on b c)
   added: (holding b) (clear c)
   goals met: 22 of 29
3. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 24 of 29
4. (unstack c d)
   deleted: (clear c) (handempty) (on c d)
   added: (holding c) (clear d)
   goals met: 21 of 29
5. (stack c b)
   deleted: (holding c) (clear b)
   added: (clear c) (handempty) (on c b)
   goals met: 26 of 29
6. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 24 of 29
7. (stack a d)
   deleted: (holding a) (clear d)
   added: (clear a) (handempty) (on a d)
   goals met: 29 of 29
